app/Http/Controllers/TopicsController.php

	public function index(Request $request, Topic $topic) {
		$topics = $topic->withOrder($request->order)
            ->with('user', 'category')
            ->paginate(20);
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

	public function update(TopicRequest $request, Topic $topic)
	{
		$this->authorize('update', $topic);
		$topic->update($request->all());
---
update `topics` set `body` = 'Incidunt illo numquam et. Id voluptatibus nisi est est qui qui. Dicta ut quia quidem. Velit et aliquam accusantium dolor.a', `topics`.`updated_at` = '2019-11-13 15:19:48' where `id` = 2